Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2sme/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=486_lang=finnish.html.tmx
Source language: fin
Languages: sme

source: Aloitin syksyllä 2010 luokanopettajanopinnot Kautokeinossa Sámi Allaskuvlassa (saamelaisessa korkeakoulussa).
sme: Álggahin čakčat 2010 luohkáoahpaheaioahpuid Guovdageainnus SámiAllaskuvllas.

source: Olin aivan varma, etten ole tarpeeksi saamelainen Allaskuvlaan.
sme: Ledjen áibba sihkkar ahte in leat doarvái sápmelaš Allaskuvlii.

source: Kasvoin Utsjoella täysi-ikäiseksi asti.
sme: Bajásšadden Ohcejogas dievas ahkái.

source: Lapsena kuljin isän mukana niin porohommissa kuin saamelaiskäräjien kokouksissakin.
sme: Mánnán johten áhči mielde nu boazobargguin go sámedikki čoahkkimiinge.

source: Jostain syystä en kuitenkaan ikinä puhunut saamea isälleni, enkä oikeastaan muillekaan.
sme: Mannu sivas in goit goasge hállan sámegiela áhččái, inge iešalddes earáidege.

source: Lopetin yläasteella kulkemasta erotusaidallakin.
sme: Heiten badjedási áigge johtimis bigálusainge.

source: Kun muutin Ouluun, en puhunut kokonaiseen vuoteen kenellekään saamea.
sme: Go fárrejin Oului, in hállan olles jahkái geasage sámegiela.

source: Utsjoelle takaisin tultaessa työ saamenkielisessä päiväkodissa elvytti kuitenkin nopeasti saamen kieleni.
sme: Go fárrejin Ohcejohkii ruovttoluotta, bargu sámegielat beaiveruovttus ealáskahtii goit johtilit mu sámegiela.

source: Myöhemmin palailin hiljalleen myös poronhoitoon.
sme: Maŋŋá máhccen gulul maid boazobargguide.

source: Allaskuvlassa kuitenkin huomasin, että minuthan on ” kasvatettu ” saamelaiseksi ja saamelaisella tavalla, huomaamattani.
sme: Allaskuvllas goit fuomášin, ahte muhan leat ” bajásgeassán ” sápmelažžan ja sámevugiin, mu fuomáškeahttá.

source: Tiedän sen nyt, että olen saamelainen.
sme: Dieđán dál ahte lean sápmelaš.

source: Ja siksi luenkin opettajaksi, jotta voin siirtää kieltä mahdollisimman monelle.
sme: Ja danin logange oahpaheaddjin, vai sáhtán sirdit giela nu máŋgasii go vejolaš.
